import matplotlib.pyplot as plt
import seaborn
plt.figure(figsize = (15, 8)) #устанавливаем размер графика
plt.title("Среднее время работы") #название графика
plt.plot([0, 1_000_000, 10_000_000, 100_000_000, 500_000_000, 1_000_000_000], [0, 0.457, 4.722, 48.469, 430.402, 578.634], 'o--', label = "merge sort")
plt.plot([0, 1_000_000, 10_000_000, 100_000_000, 500_000_000, 1_000_000_000], [0, 0.145, 1.526, 19.955, 117.824, 682], 'o--', label = "quick sort")
plt.plot([0, 1_000_000, 10_000_000, 100_000_000, 500_000_000, 1_000_000_000], [0, 0.397, 3.821, 35.682, 264.774, 343], 'o--', label = "std sort")
plt.plot([0, 1_000_000, 10_000_000, 100_000_000, 500_000_000, 1_000_000_000], [0, 0.255, 3.324, 50.391, 366.305, 799.252], 'o--', label = "shell sort")
plt.grid(True) #добавляем линии сетки
plt.legend(loc = 'best') #добавляем легенду
plt.ylabel('Время (секунды)') #подписываем ось у
plt.xlabel('Размер массива') #подписываем ось х
plt.show()
